# Data concatenation => Stacking DataFrames on top of each other (rows) or side by side (columns)

In [3]:
import pandas as pd

In [7]:
df1 = pd.DataFrame({
    "id":[1, 2, 3],
    "name":["Adam", "eve","bob"]
})

df2 = pd.DataFrame({
    "id":[4, 5, 6],
    "name":["Charlie", "Fester","Gilian"]
})

pd.concat([df1, df2]) #Concatenation is done based on rows 
pd.concat([df1, df2], ignore_index=True) #Concatenation is done based on rows

   id     name
0   1     Adam
1   2      eve
2   3      bob
3   4  Charlie
4   5   Fester
5   6   Gilian

In [ ]:
pd.concat([df1, df2], axis=1) #Concatenation is done based on columns

   id  name  id     name
0   1  Adam   4  Charlie
1   2   eve   5   Fester
2   3   bob   6   Gilian